### 1. Create a database called temp_db. Open a cursor to this newly created database.

In [1]:
import sqlite3

In [2]:

conn = sqlite3.connect('temp_db.db')
cur = conn.cursor()

### 2. In the database temp_db created in Q.No.1, create a table called emp with the attributes empno, ename, salary and deptno\

In [3]:
conn = sqlite3.connect('temp_db.db')
cur = conn.cursor()
cur.execute('CREATE TABLE IF NOT EXISTS emp(empno INTEGER,ename TEXT,salary INTEGER,deptno INTEGER)')

### 3. In the emp table created in Q.No. 2, insert any five records.

In [4]:
def insert(e,n,s,d):
    conn = sqlite3.connect('temp_db.db')
    cur = conn.cursor()
    cur.execute('INSERT INTO emp values(?,?,?,?)',(e,n,s,d))
    conn.commit()
    conn.close()

In [5]:
insert(101,'MONA',30000,10)
insert(102,'SONA',35000,20)
insert(103,'RAM',25000,30)
insert(104,'SHAM',40000,40)
insert(105,'DHAN',37000,50)

### 4. From the emp table, display all the records.

In [6]:
def Display():
    cur.execute('SELECT * FROM emp')
    record = cur.fetchall()
    return record
Display()

[(101, 'MONA', 30000, 10),
 (102, 'SONA', 35000, 20),
 (103, 'RAM', 25000, 30),
 (104, 'SHAM', 40000, 40),
 (105, 'DHAN', 37000, 50),
 (101, 'MONA', 30000, 10),
 (102, 'SONA', 35000, 20),
 (103, 'RAM', 25000, 30),
 (104, 'SHAM', 40000, 40),
 (105, 'DHAN', 37000, 50),
 (101, 'MONA', 30000, 10),
 (102, 'SONA', 35000, 20),
 (103, 'RAM', 25000, 30),
 (104, 'SHAM', 40000, 40),
 (105, 'DHAN', 37000, 50)]

### 5.From the emp table, display the records of only those employees whose salary is greater than 15000 and who belong to deptno 10

In [7]:
import sqlite3
def Display1():
    cur.execute('SELECT * FROM emp WHERE salary > 15000 and deptno==10')
    result = cur.fetchall()
    conn.commit()
    return result
Display1()

[(101, 'MONA', 30000, 10), (101, 'MONA', 30000, 10), (101, 'MONA', 30000, 10)]

### 6.From the emp table, display the records of only those employees whose salary lies between 20000 and 25000 and who do not belong to the deptno 10

In [8]:
import sqlite3
def Display2():
    cur.execute('SELECT * FROM emp WHERE salary BETWEEN 20000 and 25000 and deptno!=10')
    result = cur.fetchall()
    conn.commit()
    return result
Display2()

[(103, 'RAM', 25000, 30), (103, 'RAM', 25000, 30), (103, 'RAM', 25000, 30)]

### 7.From the emp table, display the records of only those employees whose name begins with M.

In [9]:
def Display3():
    conn = sqlite3.connect('temp_db.db')
    cur = conn.cursor()
    cur.execute('SELECT * FROM emp WHERE ename LIKE "M%" ORDER BY ename')
    result = cur.fetchall()
    conn.commit()
    conn.close()
    return result
Display3()

[(101, 'MONA', 30000, 10), (101, 'MONA', 30000, 10), (101, 'MONA', 30000, 10)]

### 8.In the emp table, delete the records of those employees who belong to deptno 30

In [10]:
def Delete():
    cur.execute('DELETE FROM emp WHERE deptno==30')
Delete()
Display()

[(101, 'MONA', 30000, 10),
 (102, 'SONA', 35000, 20),
 (104, 'SHAM', 40000, 40),
 (105, 'DHAN', 37000, 50),
 (101, 'MONA', 30000, 10),
 (102, 'SONA', 35000, 20),
 (104, 'SHAM', 40000, 40),
 (105, 'DHAN', 37000, 50),
 (101, 'MONA', 30000, 10),
 (102, 'SONA', 35000, 20),
 (104, 'SHAM', 40000, 40),
 (105, 'DHAN', 37000, 50)]

### 9.In the emp table, update the salary of an employee by 10 % by accepting the empno from the user.

In [11]:
def Update(e):
    conn = sqlite3.connect('temp_db.db')
    cur = conn.cursor()
    cur.execute('UPDATE emp SET salary=salary+(salary*10/100) WHERE empno=?',(e,))
    conn.commit()
    conn.close()

In [ ]:
Update(102)

### 10.Delete the emp table.

In [ ]:
def Delete1():
    conn = sqlite3.connect('temp_db.db')
    cur = conn.cursor()
    cur.execute('DELETE FROM emp')
    conn.commit()
    conn.close()

In [ ]:
Delete1()

In [ ]:
Display()